## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:127" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:127" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:f618eabdeede00432d7414ce9530f728d332e3aac33c36b2bf16a3fd9bc69a1d" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:51169dddf89161eb179974329f446e8742fd86b2646397e1b304c0b8f65e077c"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 127 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "aa58d7f2c1123b3ad7048bce2dd4c377-6" -> "9aec4e89c018919741d557f4baa1d761"
        id                     = "graphql.9aec4e89c018919741d557f4baa1d761.zip"
        tags                   = {}
      ~ version_id             = "AgXbQdx7knRrI0v_P.K_Lp1XXguduMEW" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "49f6291dc84bb27b95f10c7de8148425"
        id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                   = {}
      ~ version_id             = "eThlfx7hbK8wfqOFeikMWcxL89nmxLuK" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.35c47aedee3af1f95d4aeba05a58bae8.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1e54e9c95ed85b15ecd51f1bd5c6f618-4" -> "04701085e00ee3393b431b8a4d98d4b2"
      ~ id                     = "python.35c47aedee3af1f95d4aeba05a58bae8.zip" -> (known after apply)
      ~ key                    = "python.35c47aedee3af1f95d4aeba05a58bae8.zip" -> "python.04701085e00ee3393b431b8a4d98d4b2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "35c47aedee3af1f95d4aeba05a58bae8" -> "04701085e00ee3393b431b8a4d98d4b2"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "atV57yupcMNQZ0ZZ3OV.4R8t1wAKrcnA" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d797268cbec8c15a312efec7cf7b71e1" -> "e2382c9ab0f2de772c575bc898835d8d"
        id                     = "dist/200.html"
      ~ source_hash            = "d797268cbec8c15a312efec7cf7b71e1" -> "e2382c9ab0f2de772c575bc898835d8d"
        tags                   = {}
      ~ version_id             = "dTgnvv9MGO0xC4PPPQCGqv6MDPNYlyLe" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "38005bcba83ac491e6a4a06f6d9e0b0a" -> "79d6fcad599da931332f21bb4340c3a1"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "38005bcba83ac491e6a4a06f6d9e0b0a" -> "79d6fcad599da931332f21bb4340c3a1"
        tags                   = {}
      ~ version_id             = "FFoZlvQyU6qht21Lxn97gT4xZPNYOTfb" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ef55d54f752f58e5b29e8ade1d975882" -> "72de0a43a767c11b0039d6cbb476868e"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "ef55d54f752f58e5b29e8ade1d975882" -> "72de0a43a767c11b0039d6cbb476868e"
        tags                   = {}
      ~ version_id             = "WX57b1aRpjMj_D30TlNyJMtJuRORkRwN" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d797268cbec8c15a312efec7cf7b71e1" -> "e2382c9ab0f2de772c575bc898835d8d"
        id                     = "dist/index.html"
      ~ source_hash            = "d797268cbec8c15a312efec7cf7b71e1" -> "e2382c9ab0f2de772c575bc898835d8d"
        tags                   = {}
      ~ version_id             = "NyFw0EjZ8x2aMzyO.favZFWaMQf93xVe" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.99899e44.chunk.js"] will be destroyed
  # (because key ["static/js/LoginPage.99899e44.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/LoginPage.99899e44.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "fd0a4ddec99f8537108503fa4d1d12d9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/LoginPage.99899e44.chunk.js" -> null
-       key                    = "dist/static/js/LoginPage.99899e44.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.99899e44.chunk.js" -> null
-       source_hash            = "fd0a4ddec99f8537108503fa4d1d12d9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "W72T02SRsRXde7NmmP7JO9cqaraGAITk" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.99899e44.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/LoginPage.99899e44.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/LoginPage.99899e44.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "f7acc4b4f3496e2aa6c4d47261fcb01c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/LoginPage.99899e44.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/LoginPage.99899e44.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.99899e44.chunk.js.LICENSE.txt" -> null
-       source_hash            = "f7acc4b4f3496e2aa6c4d47261fcb01c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "LpgG2ufxUnMXW6vouWeeVF953r54O0_g" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.9edac3c8.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "6b67803cf5c2f64ad6e68c31010ee486"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.9edac3c8.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.9edac3c8.chunk.js"
+       source_hash            = "6b67803cf5c2f64ad6e68c31010ee486"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.9edac3c8.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "090a8c88643c29055ee9f3c15ebd0974"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.9edac3c8.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.9edac3c8.chunk.js.LICENSE.txt"
+       source_hash            = "090a8c88643c29055ee9f3c15ebd0974"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.31016da0.js"] will be destroyed
  # (because key ["static/js/app.31016da0.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.31016da0.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "8a1957010e309527aabbcc024a03f73c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.31016da0.js" -> null
-       key                    = "dist/static/js/app.31016da0.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.31016da0.js" -> null
-       source_hash            = "8a1957010e309527aabbcc024a03f73c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "rWkeKjo3tLF31ft23W4.Ji6VzofLkyXK" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.31016da0.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.31016da0.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.31016da0.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.31016da0.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.31016da0.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.31016da0.js.LICENSE.txt" -> null
-       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "0VIr5iond36qJ5BF31SZGM.w2UGJDmDp" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.81e3933f.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "12a9de16389d75b003386f62f6117e8c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.81e3933f.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.81e3933f.js"
+       source_hash            = "12a9de16389d75b003386f62f6117e8c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.81e3933f.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "3b6b61b80017ed2a756a2cec1364fac3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.81e3933f.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.81e3933f.js.LICENSE.txt"
+       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.6e46df57.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "81c5f09b9c36a8a3b920bb54b0dbd381"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.6e46df57.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.6e46df57.js"
+       source_hash            = "81c5f09b9c36a8a3b920bb54b0dbd381"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.bf576085.js"] will be destroyed
  # (because key ["static/js/runtime-app.bf576085.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/runtime-app.bf576085.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "8f79242729c9a5903fc11136bae216d2" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.bf576085.js" -> null
-       key                    = "dist/static/js/runtime-app.bf576085.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.bf576085.js" -> null
-       source_hash            = "8f79242729c9a5903fc11136bae216d2" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "aCv48zTlkMqd9Nb6Ml4kKXh2sZCHyQBM" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-05-01T23:38:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:94" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:94/invocations" -> (known after apply)
      ~ s3_key                         = "python.35c47aedee3af1f95d4aeba05a58bae8.zip" -> "python.04701085e00ee3393b431b8a4d98d4b2.zip"
        tags                           = {}
      ~ version                        = "94" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "e781a7465c57ef58cfea0c9b47f70743fabd093a" -> "6fdd84146644382983714b7d2be28a5a5d1ca4a2"
              ~ "DD_TAGS"                      = "git.commit.sha:e781a7465c57ef58cfea0c9b47f70743fabd093a,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:6fdd84146644382983714b7d2be28a5a5d1ca4a2,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "e781a7465c57ef58cfea0c9b47f70743fabd093a" -> "6fdd84146644382983714b7d2be28a5a5d1ca4a2"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "94" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:142" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:142/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "142" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "e781a7465c57ef58cfea0c9b47f70743fabd093a" -> "6fdd84146644382983714b7d2be28a5a5d1ca4a2"
              ~ "DD_TAGS"                            = "git.commit.sha:e781a7465c57ef58cfea0c9b47f70743fabd093a,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:6fdd84146644382983714b7d2be28a5a5d1ca4a2,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "e781a7465c57ef58cfea0c9b47f70743fabd093a" -> "6fdd84146644382983714b7d2be28a5a5d1ca4a2"
                # (18 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "142" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:50" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:50/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "50" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "e781a7465c57ef58cfea0c9b47f70743fabd093a" -> "6fdd84146644382983714b7d2be28a5a5d1ca4a2"
              ~ "DD_TAGS"                            = "git.commit.sha:e781a7465c57ef58cfea0c9b47f70743fabd093a,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:6fdd84146644382983714b7d2be28a5a5d1ca4a2,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "e781a7465c57ef58cfea0c9b47f70743fabd093a" -> "6fdd84146644382983714b7d2be28a5a5d1ca4a2"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "50" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 10 to add, 10 to change, 10 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8924430702)*